//Первая задача
// let a = Number(prompt("Введите первое число"));
// let b = Number(prompt("Введите второе число"));
// let c = a + b;
// alert(`Сумма чисел =  ${c}`);

//Вторая задача
// let a = Number(
//   prompt(
//     "1. Загадайте число          2. Умножьте на 5          3. Прибавьте 7          4. Введите результат вычислений"
//   )
// );
// let b = a / 5 - 7;
// alert(`Число, которое вы загадали = ${b}`);

//Третья задача
// let a = Number(prompt("Введите число (+/-)"));

// if (a > 0) alert("Ваше число > 0");
// else alert("Ваше число < 0");

//Четвёртая задача
let a = Number(prompt("Введите число от 1 до 99"));
if (a > 0 && a < 100) alert(`Good`);
else alert(`Wrong!`);
